doc: cleanup diagrams, add adrs
